Revit 2026 API

# MassLevelDataIsValidConceptualConstructionTypeElement Method

---

Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidConceptualConstructionTypeElement(
	ElementId id
)
```
```vb
Public Function IsValidConceptualConstructionTypeElement (
	id As ElementId
) As Boolean
```
```cpp
public:
bool IsValidConceptualConstructionTypeElement(
	ElementId^ id
)
```
```fsharp
member IsValidConceptualConstructionTypeElement :
        id : ElementId -> bool
```

#### Parameters

id ElementId
     The ElementId to be checked.

#### Return Value

Boolean True if the ElementId is an acceptable conceptual construction type ElementId, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

In the case that 'conceptualConstructionIsByEnergyData' is true, invalidElementId is also acceptable input.

#### Reference

MassLevelData Class

Autodesk.Revit.DB.Analysis Namespace